{
    "how_the_united_states_immigration_system_works_0.pdf": " \n \nHow the United States Immigration System Works \nU.S. immigration law is based on the following principles: the reunification of families, admitting immigrants \nwith skills that are valuable to the U.S. economy, protecting refugees, and promoting diversity. This fact sheet \nprovides basic information about how the U.S. legal immigration system is designed and functions.  \nThe body of law governing U.S. immigration policy is called the Immigration and Nationality Act (INA). The INA \nallows the United States to grant up to 675,000 permanent immigrant visas each year across various visa \ncategories. On top of those 675,000 visas, the INA sets no limit on the annual admission of U.S. citizens’ spouses, \nparents, and children under the age of 21.1 In addition, each year the president is required to consult with \nCongress and set an annual number of refugees to be admitted to the United States through the U.S. Refugee \nAdmissions Program.2 \nOnce a person obtains an immigrant visa and comes to the United States, they become a lawful permanent \nresident (LPR). In some circumstances, noncitizens already inside the United States can obtain LPR status \nthrough a process known as “adjustment of status.” \nLPRs are eligible to apply for nearly all jobs (i.e., jobs not legitimately restricted to U.S. citizens) and can remain \nin the country permanently, even if they are unemployed. After residing in the United States for five years (or \nthree years in some circumstances), LPRs are eligible to apply for U.S. citizenship. It is impossible to apply for \ncitizenship through the normal process without first becoming an LPR.  \nEach year the United States also admits a variety of noncitizens on a temporary basis. Such “non-immigrant” \nvisas are granted to everyone from tourists to foreign students to temporary workers permitted to remain in the \ncountry for years. While certain employment-based visas are subject to annual caps, other non-immigrant visas \n(including tourist and student visas) have no numerical limits. I. Family-Based Immigration\nFamily unification is an important principle governing U.S. immigration policy. The family-based immigration \nsystem allows U.S. citizens and LPRs to bring certain family members to the United States. Family-based \nimmigrants are admitted either as immediate relatives of U.S. citizens or through the family preference system.  \nAn unlimited number of visas are available every year for the immediate relatives of U.S. citizens. Prospective \nimmigrants in this category must meet standard eligibility criteria, and petitioners must meet certain age and \nfinancial requirements.3 Immediate relatives are: \nHow the United States Immigration System Works   |  American Immigration Council | September 2021 \nPage 2 of 11 \n \n▪ \nspouses of U.S. citizens;  \n▪ \nunmarried minor children of U.S. citizens (under 21 years old);4 and  \n▪ \nparents of U.S. citizens (petitioner must be at least 21 years old to petition for a parent).  \nA limited number of visas are available every year under the family preference system. Prospective immigrants \nin the family preference system must meet standard eligibility criteria, and petitioners must meet certain age \nand financial requirements.5 The family preference system includes:  \n▪ \nadult children (married and unmarried) and brothers and sisters of U.S. citizens (petitioner must be at least \n21 years old to petition for a sibling); and  \n▪ \nspouses and unmarried children (minor and adult) of LPRs. \nIn order to balance the overall number of immigrants arriving based on family relationships, Congress \nestablished a complicated system for calculating the available number of family preference visas for any given \nyear. The number is determined by starting with 480,000 (the maximum number in principle allocated for all \nfamily-based immigrants) and then subtracting the number of immediate relative visas issued during the \nprevious year and the number of aliens “paroled” into the United States during the previous year.6 Any unused \nemployment preference immigrant numbers from the preceding year are then added to this total to establish \nthe number of visas that are available for allocation through the family preference system.7 However, by law, the \nnumber of family-based visas allocated through the preference system may not be lower than 226,000.8 The \nnumber of immediate relatives often exceeds 250,000 in a given year and triggers the 226,000 minimum for \npreference visas. As a result, the total number of family-based visas often exceeds 480,000.9 In Fiscal Year (FY) \n2019, family-based immigrants comprised 68.8 percent of all new LPRs in the United States.10 \nThe family-based immigration system is summarized in Table 1. \nTable 1: Family-Based Immigration System \nCategory \nU.S. Sponsor \nRelationship \nNumerical Limit \nImmediate Relatives \nU.S. Citizen adults \nSpouses, unmarried \nminor children, and \nparents \nUnlimited \nPreference allocation \n1 \nU.S. citizen \nUnmarried adult \nchildren \n23,400* \n2A \nLPR \nSpouses and minor \nchildren \n87,900 \n2B \nLPR \nUnmarried adult \nchildren \n26,300 \n3 \nU.S. citizen \nMarried adult children \n23,400** \nHow the United States Immigration System Works   |  American Immigration Council | September 2021 \nPage 3 of 11 \n \n4 \nU.S. citizen \nBrothers and Sisters \n65,000*** \n* Plus any unused visas from the 4th preference. \n** Plus any unused visas from 1st and 2nd preference. \n***Plus any unused visas from all other family-based preferences. \nWorldwide level of family preference allocation: 480,000 minus visas issued to immediate relatives and parolees, plus \nunused employment-visas from previous fiscal year. Floor for preference categories: 226,000. \nSource:  William A. Kandel, U.S. Family-Based Immigration Policy (Washington, DC: Congressional Research Service, \nFebruary 9, 2018), 4, https://fas.org/sgp/crs/homesec/R43145.pdf.  \nIn order to be admitted through the family-based immigration system, a U.S. citizen or LPR sponsor must \npetition for an individual relative, establish the legitimacy of the relationship, meet minimum income \nrequirements, and sign an affidavit of support stating that the sponsor will be financially responsible for the \nfamily member(s) upon arrival in the United States or adjustment to LPR status within the United States.11 The \nindividual relative also must meet certain eligibility requirements that include submitting to a medical exam and \nobtaining required vaccinations (including a COVID-19 vaccination12), an analysis of any immigration or criminal \nhistory, as well as demonstrating that they will not become primarily dependent on the government for \nsubsistence.13 \nThe spouses and children who accompany or follow the principal immigrant (the one sponsored by the U.S. \ncitizen or LPR under the family-preference category) are referred to as derivative immigrants. Derivative \nimmigrants also count toward the numerical caps for the categories in Table 1. That means that many of the visa \nslots allotted for members of these categories are often actually used by the spouses and children of the \nmembers. For example, in FY 2019, 61,031 people were admitted in the category “brothers and sisters” of U.S. \ncitizens, but only 22,179 of them were actual brothers or sisters of U.S. citizens. The rest were spouses (14,956) \nand children (23,896) of the siblings of U.S. citizens.14 II. Employment-Based Immigration\nThe United States provides various ways for immigrants with valuable skills to come to the country on either a \ntemporary or a permanent basis.  \nTemporary Visa Classifications \nTemporary employment-based visa classifications permit employers to hire and petition for foreign nationals \nfor specific jobs for limited periods. Most temporary workers must work for the employer that petitioned for them \nand have limited ability to change jobs.15 There are more than 20 types of visas for temporary nonimmigrant \nworkers. These include L-1 visas for intracompany transfers; various P visas for athletes, entertainers, and skilled \nperformers; R-1 visas for religious workers; various A visas for diplomatic employees; O-1 visas for workers of \nextraordinary ability; and various H visas for both highly skilled and lesser-skilled workers. The visa classifications \nvary in terms of their eligibility requirements, duration, whether they permit workers to bring dependents, and \nother factors. In most cases, these workers must leave the United States if their status expires or if their \nemployment is terminated. It may be possible, depending on the type of job and the foreign national’s \nqualifications, for an employer to sponsor the worker for permanent employment. A foreign national does not \nHow the United States Immigration System Works   |  American Immigration Council | September 2021 \nPage 4 of 11 \n \nhave to be working for the employer in order to be sponsored. However, depending on the permanent \nimmigration category sought and the foreign national’s current nonimmigrant category, he or she may be able \nto complete the steps to become an LPR while continuing to live and work in the United States. \nPermanent Immigration \nThe overall numerical limit for permanent employment-based immigrants is 140,000 per year.16 This number \nincludes the immigrants plus their eligible spouses and minor unmarried children, meaning the actual number \nof employment-based immigrants is less than 140,000 each year.17 Any unused family preference immigrant \nnumbers from the preceding year are added to this cap to establish the number of visas that are available for \nallocation through the employment-based system.18 The total number of available visas is then divided into five \npreference categories.19 For some categories, the sponsor must first test the U.S. labor market under terms and \nconditions established by the Department of Labor, and the Secretary of Labor must certify that the petitioner’s \napplication meets certain requirements before the sponsor may file a petition with U.S.  Citizenship and \nImmigration Services (USCIS). For some categories, the sponsor’s first step is to file a petition with USCIS or the \nforeign national may self-petition. The final step is the foreign national’s application for an immigrant visa at a \nU.S. embassy or consulate abroad or an application to adjust status to LPR if in lawful status in the United States. \nFor consular processing, the immigrant visa application cannot be filed until after USCIS approves the immigrant \npetition. For adjustment of status, the time to file the application depends on whether a visa number is \nconsidered to be immediately available.20 \nThe employment-based immigration system is summarized in Table 2. \nTable 2: Permanent Employment-Based Preference System \nPreference Category \nEligibility \nYearly Numerical Limit \n1 \n“Persons of extraordinary ability” in \nthe arts, science, education, \nbusiness, or athletics; outstanding \nprofessors and researchers, \nmultinational executives and \nmanagers. \n40,040* \n2 \nMembers of the professions \nholding advanced degrees, or \npersons of exceptional ability in the \narts, science, or business. \n40,040** \n3 \nSkilled workers with at least two \nyears of training or experience, \nprofessionals with college degrees, \nor “other” workers for unskilled \nlabor that is not temporary or \n40,040*** \n“Other” unskilled laborers \nrestricted to 5,000 \nHow the United States Immigration System Works   |  American Immigration Council | September 2021 \nPage 5 of 11 \n \nseasonal. \n4 \nCertain “special immigrants” \nincluding religious workers, \nemployees of U.S. foreign service \nposts, former U.S. government \nemployees and other classes of \nforeign nationals. \n9,940 \n5 \nPersons who will invest $500,000 to \n$1 million in a job-creating \nenterprise that employs at least 10 \nfull time U.S. workers. For petitions \nfiled on or after 11/21/2019 the \ninvestment amounts increase to \n$900,000 to $1.8 million, with future \nincreases at specified intervals.21 \n9,940 \n*Plus any unused visas from the 4th and 5th preferences. \n**Plus any unused visas from the 1st preference. \n***Plus any unused visas from the 1st and 2nd preferences. \nWorldwide level of employment-based immigrants: 140,000 for principal applicants and their dependents. \nSource:  Ruth Ellen Wasem, U.S. Immigration Policy on Permanent Admissions (Washington, DC: \nCongressional Research Service, March 13, 2012), 4, https://www.fas.org/sgp/crs/homesec/RL32235.pdf.  \nIn FY 2019, immigrants admitted through the employment preferences made up 13.5 percent of all new LPRs in \nthe United States.22  III. Per-Country Ceilings\nIn addition to the numerical limits placed on the various immigration preference categories, the INA also places \na limit on how many immigrants can come to the United States from any one country. Currently, no group of \npermanent immigrants (family-based and employment-based combined) from a single country can exceed \nseven percent of the total number of people immigrating to the United States in a single fiscal year.23 This is not \na quota to ensure that certain nationalities make up seven percent of immigrants, but rather a limit that is set to \nprevent any immigrant group from dominating immigration flows to the United States.  IV. Refugees and Asylees\nRefugees are admitted to the United States based upon an inability to return to their home countries because \nof a “well-founded fear of persecution” due to their race, membership in a particular social group, political \nopinion, religion, or national origin.24 Refugees apply for admission from outside of the United States, generally \nfrom a “transition country” that is outside their home country. The admission of refugees turns on numerous \nfactors, such as the degree of risk they face, membership in a group that is of special concern to the United States \n(designated yearly by the president and Congress), and whether or not they have family members in the United \nHow the United States Immigration System Works   |  American Immigration Council | September 2021 \nPage 6 of 11 \n \nStates.  \nEach year, the president, in consultation with Congress, determines the numerical ceiling for refugee \nadmissions.25 The overall cap is broken down into limits for each region of the world. After September 11, 2001, \nthe number of refugees admitted into the United States fell drastically. After the Bush administration put new \nsecurity checks in place, annual refugee admissions returned to their previous levels and rose during the Obama \nadministration. During the Trump administration, the refugee ceiling fell sharply, from 110,000 in FY 2017 to \n45,000 in FY 2018 and 30,000 in FY 2019.26 For FY 2020, the ceiling was set at an all-time low of 18,000—although \nonly 11,814 were actually admitted (the lowest number of admitted refugees since the system was created in \n1980.)27 The FY 2021 ceiling was set at 15,000 by the Trump administration, but was subsequently raised to 62,500 \nby the Biden administration.28 However, as of August 31, 2021, only 7,637 refugees had been admitted with just \none month remaining in the current fiscal year.29 \nOf the 62,500 admissions determined by the president for FY 2021, the regional allocations are shown in Table 3 \nbelow. Given the slow pace of admissions, it is unlikely that any of these allocations will be met. \nTable 3: Presidential Determination on Refugee Admissions, FY 2021 \nAfrica \n22,000 \nEast Asia \n6,000 \nEurope and Central Asia \n4,000 \nLatin America/Caribbean  \n5,000 \nNear East/South Asia \n13,000 \nUnallocated Reserve \n12,500 \nTOTAL \n62,500 \nSource: U.S. Department of State, Bureau of Population, Refugees, and Migration, “Refugee Admissions Report as \nof July 31, 2021,” \nhttps://www.wrapsnet.org/documents/Refugee%20Admissions%20Report%20as%20of%2031%20Jul%202021.xl\nsx.  \nAsylum is available to persons already in the United States who are seeking protection based on the same five \nprotected grounds upon which refugees rely.30 They may apply at a port of entry at the time they seek admission \nor within one year of arriving in the United States. There is no limit on the number of individuals who may be \ngranted asylum each year, nor are there specific categories for determining who may seek asylum. In FY 2019, \n46,508 individuals were granted asylum.31 \nRefugees and asylees are eligible to become LPRs one year after admission to the United States as a refugee or \none year after receiving asylum.32  V. The Diversity Visa Program\nThe Diversity Visa Program was created by the Immigration Act of 1990 as a dedicated channel for immigrants \nfrom countries with low rates of immigration to the United States. Each year, 55,000 visas are allocated randomly \nHow the United States Immigration System Works   |  American Immigration Council | September 2021 \nPage 7 of 11 \n \nthrough a computer-generated lottery to nationals from countries that have sent fewer than 50,000 immigrants \nto the United States in the previous five years.33 Of the 55,000, up to 5,000 are made available for use under the \nNicaraguan Adjustment and Central American Relief Act program, created in 1997 to provide relief to certain \nasylum seekers who applied for asylum before a specific date. This results in a reduction of the actual annual \ndiversity visa limit to 50,000.34 The program was originally intended to favor immigration from Ireland (during \nthe first three years of the program at least 40 percent of the visas were exclusively allocated to Irish \nimmigrants).35 Diversity visas are now distributed on a regional basis and benefit Africans and Eastern Europeans \nin particular.36 \nTo be eligible for a diversity visa, potential applicants from qualifying countries must have a high-school \neducation (or its equivalent) or have, within the past five years, a minimum of two years working in a profession \nrequiring at least two years of training or experience. Spouses and minor unmarried children of the principal \napplicant may also enter as derivatives.37  \nImmigration bans implemented by the Trump administration effectively shut down the Diversity Visa Program \nin 2020 and left roughly 43,000 of that year’s lottery winners without their visas.38 Those 2020 lottery winners who \ndid not receive visas by the end of the fiscal year lost their chance to immigrate to the United States, prompting \nsome of them to file lawsuits against the federal government in an effort to obtain their visas.39 Although the \nBiden administration subsequently lifted the immigration bans, the Diversity Visa Program has resumed at a very \nslow pace. By the end of June 2021, the State Department had issued only 3,094 diversity visas for FY 2021.40  \nSome FY 2021 lottery winners have filed lawsuits demanding that the State Department issue their visas before \nthe end of the fiscal year.41  VI. Other Forms of Humanitarian Relief\nTemporary Protected Status (TPS) is granted to people who are in the United States but cannot return to their \nhome country because of “natural disaster,” “extraordinary temporary conditions,” or “ongoing armed \nconflict.”42 TPS is granted to a country for six, twelve, or eighteen months and can be extended beyond that if \nunsafe conditions in the country persist.43 TPS does not necessarily lead to LPR status or confer any other \nimmigration status. \nDeferred Enforced Departure (DED) provides protection from deportation for individuals whose home countries \nare unstable, therefore making return dangerous.44 Unlike TPS, which is authorized by statute, DED is at the \ndiscretion of the executive branch. DED does not necessarily lead to LPR status or confer any other immigration \nstatus. \nDeferred Action for Childhood Arrivals (DACA) is a program established in 2012 which permits certain individuals \nwho were brought to the United States while under the age of 16 and who have resided continuously in the \nUnited States since June 15, 2007, to remain in the United States and work lawfully for at least two years, so long \nas they have no significant criminal record and have graduated high school or college or received a degree \nequivalent.45 It does not confer any path to permanent legal status and requires renewal every two years.46 In \nHow the United States Immigration System Works   |  American Immigration Council | September 2021 \nPage 8 of 11 \n \n2017, the Trump administration attempted to end DACA,47 but this action was challenged in court. In June 2020, \nthe Supreme Court ruled that the administration’s attempt to terminate the program was unlawful.48 The Trump \nadministration subsequently tried to impose new limits on DACA,49 but this action was also challenged in court \nand a federal judge in New York ordered the administration to set aside the newly imposed limits.50 Separately, \na federal judge in Texas ruled that DACA was unlawful and that no new, first-time applications should be \naccepted.51 In January 2021, President Biden issued a memorandum reaffirming the federal government’s \ncommitment to DACA and pledging to appeal the Texas ruling.52 \nHumanitarian parole allows certain individuals to enter the United States, even though they may not meet the \ndefinition of a refugee and may not be eligible to immigrate through other channels. Parolees may be admitted \ntemporarily for urgent humanitarian reasons or significant public benefit.53 VII. U.S. Citizenship\nIn order to qualify for U.S. citizenship through naturalization, an individual must have had LPR status (a green \ncard) for at least five years (or three years if he or she obtained the green card through a U.S.-citizen spouse or \nthrough the Violence Against Women Act, VAWA). There are other exceptions including, but not limited to, \nmembers of the U.S. military who serve in a time of war or declared hostilities.54 Applicants for U.S. citizenship \nmust be at least 18 years old, demonstrate continuous residency, demonstrate “good moral character,” pass \nEnglish and U.S. history and civics exams (with certain exceptions), and pay an application fee, among other \nrequirements.55  \n \n Endnotes\n \n1. \nThis number results from adding the family-based annual limit, the employment-based annual limit, and the diversity program annual limit. \nSee Ruth Ellen Wasem, U.S. Immigration Policy on Permanent Admissions (Washington, DC: Congressional Research Service, March \n13,2012), 3, https://www.fas.org/sgp/crs/homesec/RL32235.pdf.  \n2. \nAmerican Immigration Council, An Overview of U.S. Refugee Law and Policy (Washington, DC: July 9, 2021), \nhttps://www.americanimmigrationcouncil.org/research/overview-us-refugee-law-and-policy.  \n3. \nINA §212(a) and INA §212(a)(4). Also see William A. Kandel, U.S. Family-Based Immigration Policy (Washington, DC: Congressional Research \nService, February 9, 2018), 3, 6-7, https://fas.org/sgp/crs/homesec/R43145.pdf.    \n4. \nVisa numbers are also available for children adopted by U.S. citizens. See U.S. Department of State, “Intercountry Adoption,” last accessed \nAugust 27,2021, https://travel.state.gov/content/adoptionsabroad/en.html.  \n5. \nINA §212(a) and INA §212(a)(4). Also see William A. Kandel, U.S. Family-Based Immigration Policy (Washington, DC: Congressional Research \nService, February 9, 2018), 3, 6-7, https://fas.org/sgp/crs/homesec/R43145.pdf.  \n6. \nINA §201(c). \n7. \nRuth Ellen Wasem, U.S. Immigration Policy on Permanent Admissions (Washington, DC: Congressional Research Service, March 13, 2012), 2, \nhttps://www.fas.org/sgp/crs/homesec/RL32235.pdf.  \n8. \nINA §201(c)(1)(B)(ii). \n9. \nRuth Ellen Wasem, U.S. Immigration Policy on Permanent Admissions (Washington, DC: Congressional Research Service, March 13, 2012), 3-\n4, https://www.fas.org/sgp/crs/homesec/RL32235.pdf.  \n10. Ryan Baugh, Annual Flow Report:  U.S. Lawful Permanent Residents: 2019 (Washington, DC: U.S. Department of Homeland Security, Office of \nImmigration Statistics, September 2020, 4, https://www.dhs.gov/sites/default/files/publications/immigration-\nstatistics/yearbook/2019/lawful_permanent_residents_2019.pdf.     \n11. U.S. Citizenship and Immigration Services, “Green Card Processes and Procedures,” last updated June 27, 2017, \nhttps://www.uscis.gov/green-card/green-card-processes-and-procedures. An affidavit of support is a document an individual must sign to \naccept financial responsibility for another person who is coming to the U.S. to live permanently. Sponsors of the affidavit of support must be \nat least 18 years old, be a U.S. citizen or lawful permanent resident, and reside in the U.S. and provide evidence showing that their annual \nincome is no less than 125% of the federal poverty level. See U.S. Citizenship and Immigration Services, “Affidavit of Support,” last updated \nMarch 19, 2021, https://www.uscis.gov/green-card/green-card-processes-and-procedures/affidavit-support.   \n12. Centers for Disease Control and Prevention, “CDC Requirements for Immigrant Medical Examinations: COVID-19 Technical Instructions for \nPanel Physicians,” last updated August 17, 2021, https://www.cdc.gov/immigrantrefugeehealth/panel-physicians/covid-19-technical-\ninstructions.html.   \n13. U.S. Citizenship and Immigration Services, “Green Card Processes and Procedures,” last updated June 27, 2017, \nhttps://www.uscis.gov/green-card/green-card-processes-and-procedures.  \n14. U.S. Department of Homeland Security, 2019 Yearbook of Immigration Statistics, “Table 7. Persons Obtaining Lawful Permanent Resident \nStatus by Type and Detailed Class of Admission: Fiscal Year 2019,” https://www.dhs.gov/immigration-statistics/yearbook/2019/table7.   \n15. Some nonimmigrant visa classifications permit foreign workers to work in the United States without an employer having first filed a petition \non the foreign worker’s behalf. These include such nonimmigrant classifications as E-1, E-2, E-3, and TN. U.S. Citizenship and Immigration \nServices, “Temporary (Nonimmigrant) Workers,” last updated September 7, 2011, https://www.uscis.gov/working-united-states/temporary-\nnonimmigrant-workers.  \n16. INA §201(d); U.S. Department of State, “Employment-Based Immigrant Visa,” last accessed August 27, 2021, \nhttps://travel.state.gov/content/visas/en/immigrate/employment.html.  \n17. U.S. Department of Homeland Security, 2019 Yearbook of Immigration Statistics, “Table 7. Persons Obtaining Lawful Permanent Resident \nStatus by Type and Detailed Class of Admission: Fiscal Year 2019,” https://www.dhs.gov/immigration-statistics/yearbook/2019/table7.  \n18. Ruth Ellen Wasem, U.S. Immigration Policy on Permanent Admissions (Washington, DC: Congressional Research Service, March 13, 2012), 2, \nhttps://www.fas.org/sgp/crs/homesec/RL32235.pdf.  \n \nHow the United States Immigration System Works   |  American Immigration Council | September 2021 \nPage 10 of 11 \n \n \n19. Ibid., 4.  \n20. U.S. Citizenship and Immigration Services, “Green Card Processes and Procedures,” last updated June 27, 2017, \nhttps://www.uscis.gov/green-card/green-card-processes-and-procedures. Whether a visa is immediately available is determined by the \nforeign national’s “priority date.” When labor certification is required, the foreign national’s “priority date” is the date that the sponsor filed \nthe application with DOL. But the “priority date” does not “attach,” as to the foreign national’s ability to receive an immigrant visa number, \nunless DOL issues the labor certification and USCIS approves the immigrant petition. If no labor certification is required, the “priority date” is \nthe date USCIS accepted the immigrant petition for filling, but USCIS petition approval is required for the date to “attach.” If the “priority \ndate” that would attach upon agency approval is current when the immigrant petition is being filed, then the foreign national, and \nderivatives if applicable, in lawful status in the United States, may file their adjustment applications at that time. If the annual and per \ncountry limits result in too few visas available for the demand, then a backlog occurs and the “priority date” gives the foreign national a \nplace in the backlog queue. When the “priority date” is reached, then the foreign national (and derivatives, if applicable) may file an \napplication to adjust status if lawfully in the United States and the immigrant petition is pending or has been approved. If the immigrant \npetition is not approved (or in some situations, was not approvable when filed), then the priority date will not “attach” and USCIS also will \ndeny the adjustment applications.  \n21. 84 Fed. Reg. 35750, 35808 (July 24, 2019) (to be codified at 8 C.F.R. § 204.6(f)(1)-(3)). The regulations also specify how the increases are to be \ncalculated and when. Id.  \n22. Ryan Baugh, Annual Flow Report: U.S. Lawful Permanent Residents: 2019 (Washington, DC: U.S. Department of Homeland Security, Office of \nImmigration Statistics, September 2020), 4, https://www.dhs.gov/sites/default/files/publications/immigration-\nstatistics/yearbook/2019/lawful_permanent_residents_2019.pdf.  \n23. INA §202(a)(2). There are exceptions to this limit, mainly in the area of family-based immigration. For example, 75% of the second family \npreference immigrants are exempt from the per-country limit. See William A. Kandel, U.S. Family-Based Immigration Policy (Washington, \nDC: Congressional Research Service, February 9, 2018), 5-6,  https://fas.org/sgp/crs/homesec/R43145.pdf.   \n24. 8 U.S.C. §§1101 et seq. P.L. 96-212, March 17, 1980. This definition conforms with the definition used in the United Nations Convention and \nProtocol relating to the status of refugees. \n25. INA §207(a). \n26. Andorra Bruno, Refugee Admissions and Resettlement Policy (Washington, DC: Congressional Research Service, December 18, 2018), 2, \nhttps://fas.org/sgp/crs/misc/RL31269.pdf.  \n27. U.S. Department of State, Bureau of Population, Refugees, and Migration, “Refugee Admissions Report as of July 31, 2021,” \nhttps://www.wrapsnet.org/documents/Refugee%20Admissions%20Report%20as%20of%2031%20Jul%202021.xlsx.   \n28. Congressional Research Service, “FY2021 Refugee Ceiling Increase,” May 11, 2021, https://www.everycrsreport.com/files/2021-05-\n11_IN11669_e3a59c7639a891e55d4ccc56ae5e18b65a3a06b3.pdf.  \n29. U.S. Department of State, Bureau of Population, Refugees, and Migration, “Refugee Admissions Report as of August 31, 2021,” \nhttps://www.wrapsnet.org/documents/Refugee%20Admissions%20Report%20as%20of%2031%20Aug%202021.xlsx.  \n30. INA §208. \n31. U.S. Department of Homeland Security, 2019 Yearbook of Immigration Statistics, “Table 16. Individuals Granted Asylum Affirmatively or \nDefensively: Fiscal Years 1990 to 2019,” https://www.dhs.gov/immigration-statistics/yearbook/2019/table16.  \n32. INA §209(a). Asylees may apply for LPR status after one year but are not required to do so. There are no numerical limitations on refugee or \nasylee adjustments of status. \n33. INA §203(c). \n34. Jill H. Wilson, The Diversity Immigrant Visa Program (Washington, DC: Congressional Research Service, October 15, 2019), 1-2, \nhttps://www.everycrsreport.com/files/20191015_R45973_d9ae0040a7eeec8daf9ed3c323d008e2857b9144.pdf.  \n35. Ibid., 1. \n36. Ibid., 2. \n37. INA §203(c).   \n38. Elliot Spagat, “In ruling, judge throws lifeline to diversity visa lottery,” Associated Press, September 5, 2020, \nhttps://apnews.com/article/virus-outbreak-politics-travel-immigration-66bb9570fdbdc12491df3057cd03b588.  \n39. Ibid.  \n40. U.S. Department of State, Monthly Immigrant Visa Issuance Statistics, “IV Issuances by FSC or Place of Birth and Visa Class,” October 2020-\n \nHow the United States Immigration System Works   |  American Immigration Council | September 2021 \nPage 11 of 11 \n \n \nJune 2021, https://travel.state.gov/content/travel/en/legal/visa-law0/visa-statistics/immigrant-visa-statistics/monthly-immigrant-visa-\nissuances.html.  \n41. Andy J. Semotiuk, “Once-In-A-Lifetime U.S. Visas To Be Lost Unless Court Intervenes,” Forbes, June 23, 2021, \nhttps://www.forbes.com/sites/andyjsemotiuk/2021/06/23/once-in-a-lifetime-us-visas-to-be-lost-unless-court-\nintervenes/?sh=500492536d1d.  \n42. INA §244. Also see American Immigration Council, “Temporary Protected Status: An Overview” (Washington, DC: August 2021), \nhttps://www.americanimmigrationcouncil.org/research/temporary-protected-status-overview.  \n43. INA §244. \n44. U.S. Citizenship and Immigration Services, “Delayed Enforced Departure,” last updated August 17, 2021, \nhttps://www.uscis.gov/humanitarian/deferred-enforced-departure.    \n45. U.S. Citizenship and Immigration Services, “Consideration of Deferred Action for Childhood Arrivals (DACA),” last updated July 19, 2021, \nhttps://www.uscis.gov/archive/consideration-deferred-action-childhood-arrivals-daca.  \n46. Ibid.  \n47. Memorandum from Elaine Duke, Acting Sec., Department of Homeland Security, to James McCament, Acting Director, U.S. Citizenship and \nImmigration Services et al., Subj: Memorandum on Recession of Deferred Action for Childhood Arrivals (DACA) (September 5, 2017), \nhttps://www.dhs.gov/news/2017/09/05/memorandum-rescission-daca.  \n48. Nina Totenburg, “Supreme Court Rules for DREAMers, Against Trump,” NPR, June 18, 2020, \nhttps://www.npr.org/2020/06/18/829858289/supreme-court-upholds-daca-in-blow-to-trump-administration; Dept. of Homeland Sec. v. \nRegents of the U. of California, 140 S. Ct. 1891 (2020). \n49. Memorandum from Chad Wolf, Acting Sec. Department of Homeland Security, to Mark Morgan, Senior Official Performing the Duties of \nCommissioner, at al., Subj: Reconsideration of the June 15, 2012 Memorandum Entitled “Exercising Prosecutorial Discretion with Respect to \nIndividuals Who Came to the United States as Children” (July 28, 2020), \nhttps://www.dhs.gov/sites/default/files/publications/20_0728_s1_daca-reconsideration-memo.pdf.  \n50. Michelle Hackman, “DACA Is Restored After Court Rules DHS Head Served Illegally,” The Wall Street Journal, November 15, 2020, \nhttps://www.wsj.com/articles/federal-judge-invalidates-trump-administration-s-daca-rollback-11605400169?page=1; Maria Sacchetti, \n“Federal judge restores DACA, orders DHS to accept first-time applications from immigrants,” The Washington Post, December 4, 2020,  \nhttps://www.washingtonpost.com/immigration/daca-restored-dreamers/2020/12/04/37254908-367a-11eb-8d38-\n6aea1adb3839_story.html.  \n51. Maria Sacchetti and Amy B Wang, “U.S. Judge blocks new applicants to program that protects undocumented ‘dreamers’ who arrived as \nchildren,” The Washington Post, July 17, 2021, https://www.washingtonpost.com/immigration/daca-court-decision/2021/07/16/6c9a35be-\ne677-11eb-a41e-c8442c213fa8_story.html; State of Texas, et al., v. The United States of America, et al., and Karla Perez and the State of New \nJersey. United States District Court: Southern District of Texas, Civil Action No. 1:18-CV-00068, July 16, 2021, \nhttps://cliniclegal.org/resources/humanitarian-relief/deferred-action-childhood-arrivals/state-texas-et-al-v-united-states.  \n52. Memorandum from President Joseph R. Biden, Jr., to the Attorney General and Secretary of Homeland Security, Subj: Preserving and \nFortifying Deferred Action for Childhood Arrivals (DACA), January 21, 2021, https://www.whitehouse.gov/briefing-\nroom/presidentialactions/2021/01/20/preserving-and-fortifying-deferred-action-for-childhood-arrivals-daca/.  \n53. U.S. Citizenship and Immigration Services, “Humanitarian or Significant Public Benefit Parole for Individuals Outside the United States,” last \nupdated August 26, 2021, https://www.uscis.gov/humanitarian/humanitarian-parole.  \n54. INA §319. \n55. Holly Straut-Eppsteiner, U.S. Naturalization Policy (Washington, DC: Congressional Research Service, updated May 3, 2021), 3-6, \nhttps://fas.org/sgp/crs/misc/R43366.pdf.  \n",
    "More_about_visas.docx": "Comprehensive Guide to U.S. Immigration Law\nOverview\nU.S. immigration law is governed primarily by the Immigration and Nationality Act (INA), which outlines the various visa categories, eligibility requirements, and processes for both immigrant and non-immigrant visas.\nImmigrant Visas\nImmigrant visas are intended for individuals who wish to live permanently in the United States. Key categories include family-sponsored and employment-based visas.\nFamily-Sponsored Immigrant Visas\nImmediate Relatives of U.S. Citizens (IR Visas):\nTypes: Spouses (IR-1), unmarried children under 21 (IR-2), parents of U.S. citizens aged 21 or older (IR-5).\nDocuments: Form I-130, proof of relationship (marriage/birth certificates), proof of U.S. citizenship, police certificates, medical examination results.\nApplication: Filed by the U.S. citizen, processed by USCIS, then by the National Visa Center (NVC) for consular processing.\nFamily Preference Categories:\nF1: Unmarried sons and daughters of U.S. citizens.\nF2A: Spouses and minor children of Legal Permanent Residents (LPR).\nF2B: Unmarried adult children of LPRs.\nF3: Married sons and daughters of U.S. citizens.\nF4: Brothers and sisters of U.S. citizens.\nDocuments and Application: Similar to immediate relatives but include waiting periods due to annual caps​ (USCIS)​​ (American Immigration Council)​.\nEmployment-Based Immigrant Visas\nEB-1: Priority Workers:\nTypes: Individuals with extraordinary ability, outstanding professors/researchers, multinational executives.\nDocuments: Form I-140, evidence of extraordinary ability, employment offer.\nApplication: Employer or self-petitioner files Form I-140 with USCIS.\nEB-2: Professionals with Advanced Degrees or Exceptional Ability:\nDocuments: Form I-140, labor certification, proof of qualifications.\nApplication: Similar to EB-1, with additional labor market testing for certain categories.\nEB-3: Skilled Workers, Professionals, and Other Workers:\nDocuments: Form I-140, labor certification, proof of skills/education.\nApplication: Employer files Form I-140, follows similar steps to EB-2​ (USCIS)​​ (American Immigration Council)​.\nNon-Immigrant Visas\nNon-immigrant visas are for temporary stays in the United States.\nBusiness/Tourism Visas\nB-1: Business Visitor:\nDocuments: Form DS-160, passport, visa fee receipt, invitation letter.\nApplication: Submit DS-160, attend visa interview at a U.S. consulate.\nB-2: Tourist Visitor:\nDocuments: Form DS-160, passport, visa fee receipt, proof of ties to home country.\nApplication: Same as B-1​ (AUWCL)​.\nWork Visas\nH-1B: Specialty Occupations:\nDocuments: Form I-129, job offer, proof of qualifications, LCA.\nApplication: Employer files Form I-129, visa interview follows approval.\nL-1: Intracompany Transferee:\nDocuments: Form I-129, proof of employment with multinational company.\nApplication: Employer files Form I-129, visa interview follows approval​ (American Immigration Council)​.\nStudent/Exchange Visitor Visas\nF-1: Academic Student:\nDocuments: Form I-20, SEVIS fee receipt, Form DS-160, financial support documents.\nApplication: Complete DS-160, pay SEVIS fee, visa interview.\nJ-1: Exchange Visitor:\nDocuments: Form DS-2019, SEVIS fee receipt, Form DS-160.\nApplication: Complete DS-160, pay SEVIS fee, visa interview​ (AUWCL)​.\nResources and Legal Texts\nImmigration and Nationality Act (INA): The primary body of law governing immigration, found in 8 U.S.C.\nUSCIS Guidelines: Provides comprehensive instructions on immigration procedures and policies.\nFAQs and Case Studies: Available on websites like USCIS, American Immigration Council, and legal education platforms.\nKey Resources\nUSCIS Laws and Policy\nAmerican Immigration Council\nIntroduction to U.S. Immigration Law - American University\nThese resources offer detailed explanations, official guidelines, and case studies to help understand and navigate U.S. immigration law.\n4o\n\n",
    "Stap_2.docx": "Objective: Extract key information and annotate the data with relevant categories such as visa type, required documents, eligibility criteria, and application processes.\n1. Extract Key Information from the Documents\nDocument: Visitor_Visa.docx\nVisa Types and Activities Permitted:\nB-1 (Business Visitor): Consulting with business associates, attending conventions/conferences, settling estates, negotiating contracts.\nB-2 (Tourist Visitor): Tourism, vacations, visiting friends/relatives, medical treatment, participating in social events, amateur participation in events/contests, short recreational courses.\nActivities Not Permitted on Visitor Visas:\nStudy, employment, paid performances, working as foreign press, permanent residence, birth tourism.\nApplication Process:\nComplete the Online Visa Application: Form DS-160.\nSchedule an Interview: Required for ages 14-79 (with some exceptions).\nPrepare for Interview: Gather documents (passport, DS-160 confirmation page, photo, application fee receipt).\nAdditional Information:\nEntering the United States: Visa does not guarantee entry, determined by CBP officials.\nExtending Stay: Must apply for an extension through USCIS.\nChange of Status: Can request to change nonimmigrant status if circumstances change.\nVisa Renewal: Same process as initial application.\nDocument: More_about_visas.docx\nImmigrant Visas:\nFamily-Sponsored Immigrant Visas: Immediate relatives (IR visas), family preference categories (F1, F2A, F2B, F3, F4).\nEmployment-Based Immigrant Visas: EB-1, EB-2, EB-3 categories.\nNon-Immigrant Visas:\nBusiness/Tourism Visas: B-1, B-2.\nWork Visas: H-1B, L-1.\nStudent/Exchange Visitor Visas: F-1, J-1.\nRequired Documents and Application Processes:\nFamily-based: Form I-130, proof of relationship, proof of U.S. citizenship, police certificates, medical examination results.\nEmployment-based: Form I-140, evidence of qualifications, labor certification.\nDocument: how_the_united_states_immigration_system_works_0.pdf\nPrinciples of U.S. Immigration Law:\nFamily reunification, valuable skills for the economy, refugee protection, promoting diversity.\nLaw: Immigration and Nationality Act (INA).\nImmigrant Visas:\nFamily-Based: Immediate relatives, preference categories.\nEmployment-Based: Five preference categories, annual numerical limits.\nNon-Immigrant Visas:\nTemporary Visa Classifications: Over 20 types including L-1, P, R, A, O, and H visas.\nRefugees and Asylum:\nRefugee Admissions: Annual numerical ceiling set by the president.\nAsylum: No numerical limit, based on fear of persecution.\nDiversity Visa Program:\nPurpose: Immigration from countries with low U.S. immigration rates.\nEligibility: High-school education or two years of work experience.\nHumanitarian Protections:\nTemporary Protected Status (TPS): For those who cannot return home safely.\nDeferred Enforced Departure (DED): Discretionary protection.\nDeferred Action for Childhood Arrivals (DACA): For individuals brought to the U.S. as children.\nNaturalization:\nRequirements: LPR status, residency, good moral character, English and civics exams, application fee.\n2. Annotate Data\nVisa Type: B-1, B-2, F-1, J-1, H-1B, L-1, IR-1, IR-2, IR-5, F1, F2A, F2B, F3, F4, EB-1, EB-2, EB-3.\nRequired Documents: Form DS-160, Form I-130, Form I-140, proof of relationship, proof of U.S. citizenship, police certificates, medical examination results, employment offer, labor certification.\nEligibility Criteria: Relationship to U.S. citizen or LPR, job offer, qualifications, proof of financial support.\nApplication Processes: Online application (DS-160), interview scheduling, documentation preparation, consular processing, adjustment of status.\n\n",
    "Structure_1.docx": "Visa Types and Activities Permitted\nB-1 (Business Visitor):\nConsulting with business associates\nAttending conventions/conferences\nSettling estates\nNegotiating contracts\nB-2 (Tourist Visitor):\nTourism\nVacations\nVisiting friends/relatives\nMedical treatment\nParticipating in social events\nAmateur participation in events/contests\nShort recreational courses\nActivities Not Permitted on Visitor Visas\nStudy\nEmployment\nPaid performances\nWorking as foreign press\nPermanent residence\nBirth tourism\nApplication Process\nComplete the Online Visa Application:\nForm DS-160\nSchedule an Interview:\nRequired for ages 14-79 (some exceptions apply)\nPrepare for Interview:\nGather documents: passport, DS-160 confirmation page, photo, application fee receipt\nAdditional Information\nEntering the United States: Visa does not guarantee entry; determined by CBP officials\nExtending Stay: Apply for an extension through USCIS\nChange of Status: Request change in nonimmigrant status if circumstances change\nVisa Renewal: Same process as initial application\nDocument: More_about_visas.docx\nImmigrant Visas\nFamily-Sponsored Immigrant Visas:\nImmediate Relatives (IR visas): IR-1 (spouses), IR-2 (unmarried children under 21), IR-5 (parents)\nFamily Preference Categories: F1 (unmarried adult children of U.S. citizens), F2A (spouses and minor children of LPRs), F2B (unmarried adult children of LPRs), F3 (married sons and daughters of U.S. citizens), F4 (brothers and sisters of U.S. citizens)\nEmployment-Based Immigrant Visas:\nEB-1: Priority Workers (individuals with extraordinary ability, outstanding professors/researchers, multinational executives)\nEB-2: Professionals with advanced degrees or exceptional ability\nEB-3: Skilled workers, professionals, and other workers\nNon-Immigrant Visas\nBusiness/Tourism Visas:\nB-1 (Business Visitor)\nB-2 (Tourist Visitor)\nWork Visas:\nH-1B (Specialty Occupations)\nL-1 (Intracompany Transferee)\nStudent/Exchange Visitor Visas:\nF-1 (Academic Student)\nJ-1 (Exchange Visitor)\nRequired Documents and Application Processes\nFamily-Based Visas:\nForm I-130, proof of relationship, proof of U.S. citizenship, police certificates, medical examination results\nEmployment-Based Visas:\nForm I-140, evidence of qualifications, labor certification\nDocument: how_the_united_states_immigration_system_works_0.pdf\nPrinciples of U.S. Immigration Law\nFamily reunification, valuable skills for the economy, refugee protection, promoting diversity\nLaw: Immigration and Nationality Act (INA)\nImmigrant Visas\nFamily-Based Visas:\nImmediate relatives (no numerical limit)\nPreference categories (annual numerical limits)\nEmployment-Based Visas:\nFive preference categories with annual numerical limits\nNon-Immigrant Visas\nTemporary Visa Classifications:\nOver 20 types, including L-1 (intracompany transfers), P (athletes/entertainers), R (religious workers), A (diplomatic employees), O (extraordinary ability), H (skilled/unskilled workers)\nRefugees and Asylum\nRefugee Admissions:\nAnnual ceiling set by the president\nAsylum:\nNo numerical limit, based on fear of persecution\nDiversity Visa Program\nPurpose: Immigration from countries with low U.S. immigration rates\nEligibility: High-school education or two years of work experience\nHumanitarian Protections\nTemporary Protected Status (TPS): For those who cannot return home safely\nDeferred Enforced Departure (DED): Discretionary protection\nDeferred Action for Childhood Arrivals (DACA): For individuals brought to the U.S. as children\nNaturalization\nRequirements: LPR status, residency, good moral character, English and civics exams, application fee\nNext Steps\nReview the cleaned and standardized data.\nUse the annotated data for further processing, analysis, or model training as required.\n\n"
}